Охотники_и_рыболовы/src/Reports/ДобытаяДичь/ДобытаяДичь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДобытаяДичь</name>
  <attributes>
    <name>ОсновнаяОрганизация</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобычаПо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подробно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Охотники_и_рыболовы/src/Reports/ДобытаяДичь/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОсновнаяОрганизация = ЭтотОбъект.ОсновнаяОрганизация;
	
	Если НЕ ОсновнаяОрганизация.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОхотхозяйствоПользователя",ОсновнаяОрганизация);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОхотхозяйствоПользователя")).Использование =Ложь;
	КонецЕсли;	
	
	Если НЕ ЭтотОбъект.Подробно Тогда
		Если ЭтотОбъект.ДобычаПо Тогда
			ИмяГруппировки = "ТМ";
		Иначе
			ИмяГруппировки = "ТО";
	КонецЕсли;	
	Иначе ИмяГруппировки = "П";
	КонецЕсли;
	
	Для Каждого ГруппировкаСКД Из КомпоновщикНастроек.Настройки.Структура Цикл
			ГруппировкаСКД.Использование = ?(ГруппировкаСКД.Имя = ИмяГруппировки, Истина, Ложь);
	КонецЦикла;
	
	ПериодОтчета = ЭтотОбъект.ПериодОтчета;
	Если ЗначениеЗаполнено(ПериодОтчета) Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",ПериодОтчета);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Использование =Ложь;
	КонецЕсли;	

	ОхотаСервер.ЗаполнитьЗаголовокОтчета(ЭтотОбъект);
КонецПроцедуры
